P09-JMeter/informe_html/statistics.json
{
  "Reptiles" : {
    "transaction" : "Reptiles",
    "sampleCount" : 23578,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2778437526507715,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 787.3242728820917,
    "receivedKBytesPerSec" : 2854.0504891975825,
    "sentKBytesPerSec" : 194.52445413981368
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 424297,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5573100917517757,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 14152.66844563042,
    "receivedKBytesPerSec" : 55295.34774485073,
    "sentKBytesPerSec" : 7232.050989722315
  },
  "Dogs" : {
    "transaction" : "Dogs",
    "sampleCount" : 23571,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.3194603538246177,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 787.5112759346497,
    "receivedKBytesPerSec" : 3303.855899819585,
    "sentKBytesPerSec" : 191.4944411208279
  },
  "Sign In" : {
    "transaction" : "Sign In",
    "sampleCount" : 70719,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2594917914563277,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 2360.6836465600695,
    "receivedKBytesPerSec" : 9043.813874104966,
    "sentKBytesPerSec" : 1632.191427504423
  },
  "Main Catalog" : {
    "transaction" : "Main Catalog",
    "sampleCount" : 70721,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1005217686401485,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 2360.6716069163494,
    "receivedKBytesPerSec" : 11140.201490419922,
    "sentKBytesPerSec" : 1295.545110811386
  },
  "Birds" : {
    "transaction" : "Birds",
    "sampleCount" : 23562,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2796027501909903,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 787.4210473548775,
    "receivedKBytesPerSec" : 2852.863364928316,
    "sentKBytesPerSec" : 192.2414666393744
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 70716,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.431401662990009,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.0,
    "throughput" : 2360.8987413614664,
    "receivedKBytesPerSec" : 11686.90988277468,
    "sentKBytesPerSec" : 1816.785359563316
  },
  "Sign Out" : {
    "transaction" : "Sign Out",
    "sampleCount" : 70707,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.3529919244204827,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.0,
    "throughput" : 2361.1500701262275,
    "receivedKBytesPerSec" : 11353.811470021037,
    "sentKBytesPerSec" : 1461.8839301367461
  },
  "Home" : {
    "transaction" : "Home",
    "sampleCount" : 70723,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9073427315017711,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 2359.084692618166,
    "receivedKBytesPerSec" : 3112.4252145772875,
    "sentKBytesPerSec" : 453.78952766936857
  }
}